import React from 'react';

import { Ellipsis } from '@baifendian/adhere';

export default () => (
  <div style={{ position: 'relative', width: 200, padding: 10, border: '1px solid #ccc' }}>
    <Ellipsis wrap={true} wrapLines={6}>
      React 是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是React
      是如今应用最广泛、最受欢迎的前端开发库之一，不仅有着精简的
      UI，而且非常容易上手。通过多年的迭代，其精妙的设计思想吸引了全世界网页开发者。最重要的是
    </Ellipsis>
  </div>
);
